#!/usr/bin/env python3
# -*- encoding utf-8 -*-

text1 = """
# 01  

# 反对和违背党的四项基本原则教学行为  

# 【典型案例】  

苏某，中共党员，某大学法学院副教授，法制史教师，因其幽默风趣、知识丰富，颇受学生敬重和欢迎。在课堂教学中，苏某经常言语出格，多次调侃、讽刺党的领导，声称西方体制才是“民主灯塔”，“社会主义和共产主义只是口号，与宗教信仰并无本质区别”。  

# 【案例评析】  

关于苏某上述行为的定性，主要有以下两种意见：  

第一种意见认为，苏某作为教师，课堂教学不同于在社会发表，且多具有调侃性质，不宜作违纪认定，鉴于其  

# 2高校系统违纪违法行为认定与处理  

言论不当，可给予批评教育。  

第二种意见认为，苏某在教学中的上述言行违背党的四项基本原则，应当依据《纪律处分条例》第五十一条第一款第（一）项（公开发表违背四项基本原则言行等)和《事业单位工作人员处分规定》第十六条第一款第（一）项（散布有损宪法权威、中国共产党领导和国家声誉的言论的行为）等规定予以处理。  

我们同意第二种意见。  

高校课堂是意识形态前沿阵地。高校教师在日常的教学生活中，必须严格遵守党的四项基本原则，在教学中始终保持高度的政治敏感性，旗帜鲜明讲政治，与党中央保持高度一致。高校教师无论出于何种动机，都不能违背包括党的四项基本原则在内的基本路线、方针、政策。《纪律处分条例》第五十一条规定，通过网络、广播、电视、报刊、传单、书籍等，或者利用讲座、论坛、报告会、座谈会等方式，公开发表违背四项基本原则，违背、歪曲党的改革开放决策，或者其他有严重政治问题的文章、演说、宣言、声明等，情节较轻的，给予警告或者严重警告处分；情节较重的，给予撤销党内职务或者留党察看处分；情节严重的，给予开除党籍处分。该规定为规范高校教师教学活动的政治立场和方向，划出一条不能逾越的政治红线。党的领导是四项基本原则之一，本案例中，苏某身为中共党员和教师，拥护党的领导、遵守宪法规定，是基本的政治品格和应尽职责，但他为活跃课堂氛围，在课堂上调侃、讽刺党的领导，毫无政治底线，无论从言论的公开程度看，还是从言论的具体内容看，都符合前述第五十一条列举的违背四项基本原则言行，构成公开发表违背四项基本原则行为。  

青少年是祖国的未来，也是共产主义事业薪火相传的中坚力量。教师不能只做传授书本知识的教书匠，而要成为塑造学生品格、品行、品位的“大先生”，其一言一行都给学生以极大影响，因此更应该时刻注意并约束自己的言行，引导学生树立政治方向、端正“三观”。高校是对青年进行思想政治教育的重要平台，也是防止国外反动势力企图渗透广大青年思想、争夺意识形态控制权的前沿阵地。《中华人民共和国教育法》（以下简称《教育法》）第六条第二款规定，国家在受教育者中进行爱国主义、集体主义、中国特色社会主义的教育，进行理想、道德、纪律、法治、国防和民族团结的教育。历史教训一再告诫我们，教师存在违背四项基本原则言行，必然扰乱青年学生思想、影响其行动，甚至受人蛊惑后出现扰乱社会秩序、企图颠覆国家政权等违法犯罪行为。所以，对本案例中类  

# 4高校系统违纪违法行为认定与处理  

似言行必须高度警惕、及时处理，不能等闲视之。  

# 【需要注意的问题】  

反对和违背党的四项基本原则教学行为具体表现情形  

四项基本原则是我国宪法规定的立国之本，高校教师在教学活动中，必须严格遵守宪法法律规定，依法治教、爱党爱国。所以，无论是否是党员，都必须增强“四个意识”、坚定“四个自信”、做到“两个维护”，这是教学活动和业外活动的根本政治要求，也是首要的职业道德和规范。实践中，高校教职工反对和违背四项基本原则的言行主要包括以下情形：  

1．反对和违背党的领导。党的领导是历史和人民的正确选择，拥护党的领导是每一个中国人应尽的职责。在个别高校教师中有的非议党的领导，公然鼓吹西方“三权鼎立”“多党执政”“宪政”等资产阶级自由化思想，期望党丧失执政地位；有的以调侃为名，行讽刺之实，如本案例中苏某声称“社会主义和共产主义只是口号，与宗教信仰并无本质区别”；有的以学术研究和针砭时弊为名，影射、攻击党的领导。2023年2月，中共中央办公厅、国务院办公厅印发《关于加强新时代法学教育和法学理论研究的意见》重申，要坚定不移走中国特色社会主义法治道路，坚持党的领导、人民当家作主、依法治国有机统一，引导广大法学院校师生和法学理论工作者在原则问题和大是大非面前旗帜鲜明、立场坚定，坚决反对和抵制西方“宪政”“三权鼎立”“司法独立”等错误观点。  

2.反对和违背社会主义道路。公有制是社会主义特征的重要体现，有的鼓吹资本主义私有制，以破除“垄断”、鼓励竞争为名，主张国有资产或公司私有化。  

3．反对和违背人民民主专政。主要表现在攻击、反对人民代表大会、政协等基本政治制度，主张取消，借鉴西方民主等。  

4．反对和违背马列主义、毛泽东思想、邓小平理论、“三个代表”重要思想、科学发展观和习近平新时代中国特色社会主义思想。  

需要注意的是，上述违纪违法行为呈现出相互交织的特点，难以截然区分。比如，违背党的领导言行与违背马列主义等党的指导思想言行往往具有内在一致性，反对党的领导往往可具体表现为反对党的指导思想。遇到此类情形，可以客观写实形式表述和归纳。此外，上述言论不仅  

# 6高校系统违纪违法行为认定与处理  

在课堂教学、科研指导、业务交流中可认定为违纪，在社交软件及自媒体中传播、点评违规涉政言论，也可按情节、影响等后果给予处理。  

# 关于取证思路  

一方面，调取相关人员陈述、证言等材料。其中，要注意固定教师相关言行主观动机、具体内容，相关学生等听众评价、感觉，是否造成媒体关注、舆情炒作等后果。在采取多媒体技术开展的教学活动，应当调取视频音频等电子数据，交由相关教师、学生确认后作为证据使用。另一方面，对实践中存在的“高级红、低级黑”言行，如表面上拥护、歌颂党的领导，实际上歪曲、低毁党的形象等行为，需要坚持实质把握标准，强化“穿透性”思维，从行为动机、日常经验、师生评价、产生后果等综合判断。此外，建议关注相关人员行为动机，有的出于个人私怨、发泄不满，有的出于政治目的，有的为标新立异等，上述动机可能对处理结果产生一定影响，但均不影响行为的定性。  

# 把握错与非错界限  

在办理高校系统涉及政治纪律案件时，对于是否会影响教职工教学积极性和学术自由顾虑，我们认为，教学科研和学术研究并非法外之域，必须有纪法边界，学术自由不是违规违纪的理由。宽松软的管理治理坏境只会扰乱教职工思想，影响教研和学术研究工作。对错误言行依规依纪处理，不但不会影响教学工作，反而是规范教学活动、保障学术自由的重要保障  

具有批评性质正常的言论和学术自由与违反教学纪律行为两者具有以下几个方面的区别：首先，从主观动机看，正常的批评性质言论，即便是言辞激烈甚至偏激，但主观动机均是正面和出于公心的；而违背党的四项基本原则的言行主观动机虽然各异，但均是具有否定甚至反对党执政地位的基础的具体目的。其次，从行为表现看，正常的批评言行大多坦荡公开，没有遮掩或要求隐瞒的表现；而违背党的四项基本原则言行大多遮遮掩掩，有的披上个人建议、出于公心批评、学术研究等外衣，有的一再表示“仅限于这个场合，不能外传”。最后，从政治影响看，违背党的四项基本原则的言行会产生不良政治后果，大多会扰乱学生思想，而批评性质言行不会。实践中，对出于批评目的的无心之过，一般不宜给予纪律处分，可给予批评教育等措施。此外，对一些不当言论是否违背四项基本原则，纪检监察机关把握不准的，可征求宣传部门意见。  

# 8高校系统违纪违法行为认定与处理  

同时，为防止违背四项基本原则讲课内容等问题发生，纪检监察机关可发挥以案治本功能，建议学校党委等部门加强监督管理，如建立违反政治纪律和规矩教学行为负面清单、教学课件课前审核和课后备案、随机督查等机制。  

# 把握此错与彼错界限  

与妄议、丑化等行为的区别。实践中，有的教师言论涉及妄议党中央大政方针，破坏党的集中统一，有的丑化党和国家形象、诋毁、污蔑党的国家领导人，依据《纪律处分条例》第五十一条第一款第（二）项、第（三）项构成违纪。违背四项基本原则行为与此类行为区别的关键在于，丑化党和国家形象、妄议党中央大政方针往往针对具体政策和特定对象，产生的后果也尚未达到违背“四项基本原则”后果。当然，如果是多次丑化党和国家形象，性质恶劣、后果严重，已经达到违背四项基本原则后果的，按本错误认定，且将丑化等行为作情节表述。值得注意的是，对非中共党员和非公职人员普通教师发表上述言论，有观点认为不构成违法。我们认为，上述言行违背宪法和法律规定，损害国家利益，《事业单位工作人员处分规定》第十六条第一款第（一）项、《事业单位人事管理条例》第二十八条第（一）项等规定均明确规定，事业单位工作人员损害国家声誉和利益可给予处分，故对上述“双非”人员仍可给予处分。  

此外，在认定事实与适用条款时需要注意，违背与反对行为必须具有一定的公开性，需要面向特定或不特定群体，私下非议行为不宜作违纪违法认定，可采取批评教育等措施。反对四项基本原则与违背四项基本原则言行，分别适用《纪律处分条例》第五十条第一款（公开发表坚持资产阶级自由化立场、反对四项基本原则，反对党的改革开放决策的文章、演说等言行）、第五十一条第一款第（一）项（公开发表违背四项基本原则行为等），需要区分反对与违背四项基本原则行为：反对主要针对全盘否定行为，如反对党的执政地位、攻击党的基本制度等；违背尚未达到全盘否定程度，如歪曲、污蔑等。  
"""

text2 = """
典型案例
苏某，中共党员，某大学法学院副教授，法制史教师，因其幽默风趣、知识丰富，颇受学生敬重和欢迎。在课堂教学中，苏某经常言语出格，多次调侃、讽刺党的领导，声称西方体制才是“民主灯塔”，“社会主义和共产主义只是口号，与宗教信仰并无本质区别”。  
"""

text = text2
